#  ол€ каждый день ложитс€ спать ровно в полночь и недавно узнал, 
# что оптимальное врем€ дл€ его сна составл€ет X минут. 
#  ол€ хочет поставить себе будильник так, чтобы он прозвенел ровно через X 
# минут после полуночи, однако дл€ этого необходимо указать врем€ сигнала 
# в формате часы, минуты. 
# ѕомогите  оле определить, на какое врем€ завести будильник.
# „асы и минуты в выводе программы должны располагатьс€ на разных строках (см. пример работы программы)
a = int(input())
print(a//60) 
print(a%60)