# ≈сть строка s = "abcdefghijk".
# ¬ поле ответа через пробел запишите строки (без кавычек), 
# полученные в результате следующих операций:
# s = 'abcdefghijk'
# s[3:6]
# s[:6]
# s[3:]
# s[::-1]
# s[-3:]
# s[:-6]
# s[-1:-10:-2]
# ѕопробуйте найти ответ к этой задаче, не использу€ интерпретатор Python. ≈сли без интерпретатора 
# решить не получаетс€, разберитесь, почему вывод€тс€ именно такие строки в каждом из вариантов.
# »тоговый формат ответа должен выгл€деть следующим образом:
# abcd efg hijklmnop qrst uvw xy z
def abcdef defghijk kjihgfedcba ijk abcde kigec